#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.tobiasmichael_website.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:097624145609:certificate/3ad9b6a2-87f9-4365-b1f4-bfa2383ff282]
module.tobiasmichael_website.aws_s3_bucket.this: Refreshing state... [id=tobiasmichael.de]
module.tobiasmichael_zone.aws_route53_zone.this: Refreshing state... [id=Z0694247156THRT174T14]
module.tobiasmichael_website.aws_cloudfront_origin_access_identity.cf_oai: Refreshing state... [id=E33HNLRKSGCZ1R]
module.tobiasmichael_zone.aws_route53_record.this["0"]: Refreshing state... [id=Z0694247156THRT174T14_tobiasmichael.de_MX]
module.tobiasmichael_website.aws_route53_record.acm_certificate_validation_records["*.tobiasmichael.de"]: Refreshing state... [id=Z0694247156THRT174T14__1e4fe2ba2566411a4041e85344cdd5a3.tobiasmichael.de._CNAME]
module.tobiasmichael_website.aws_route53_record.acm_certificate_validation_records["tobiasmichael.de"]: Refreshing state... [id=Z0694247156THRT174T14__1e4fe2ba2566411a4041e85344cdd5a3.tobiasmichael.de._CNAME]
module.tobiasmichael_website.aws_acm_certificate_validation.cert_validation: Refreshing state... [id=2023-03-28 08:00:21.523 +0000 UTC]
module.tobiasmichael_website.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=tobiasmichael.de]
module.tobiasmichael_website.aws_s3_bucket_public_access_block.this: Refreshing state... [id=tobiasmichael.de]
module.tobiasmichael_website.aws_s3_bucket_policy.this: Refreshing state... [id=tobiasmichael.de]
module.tobiasmichael_website.aws_cloudfront_distribution.website: Refreshing state... [id=E2P4QX2XPURGLK]
module.tobiasmichael_website.aws_route53_record.website_cloudfront_record: Refreshing state... [id=Z0694247156THRT174T14_tobiasmichael.de_A]
module.tobiasmichael_website.aws_route53_record.www_website_record: Refreshing state... [id=Z0694247156THRT174T14_www.tobiasmichael.de_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.selina_website.aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "*.selinaklepic.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.selinaklepic.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "selinaklepic.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.selinaklepic.com",
          + "selinaklepic.com",
        ]
      + tags_all                  = {
          + "Environment" = "prod"
          + "Prefix"      = "tme"
          + "Terraform"   = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.selina_website.aws_acm_certificate_validation.cert_validation will be created
  + resource "aws_acm_certificate_validation" "cert_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.selina_website.aws_cloudfront_distribution.website will be created
  + resource "aws_cloudfront_distribution" "website" {
      + aliases                        = [
          + "selinaklepic.com",
          + "www.selinaklepic.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "Prefix"      = "tme"
          + "Terraform"   = "true"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods          = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id          = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods           = [
              + "GET",
              + "HEAD",
            ]
          + compress                 = false
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = "88a5eaf4-2fd4-4709-b370-b4c650ea3fcf"
          + target_origin_id         = "selinaklepic.com"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "redirect-to-https"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "selinaklepic.com"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          + cloudfront_default_certificate = false
          + minimum_protocol_version       = "TLSv1.2_2021"
          + ssl_support_method             = "sni-only"
        }
    }

  # module.selina_website.aws_cloudfront_origin_access_identity.cf_oai will be created
  + resource "aws_cloudfront_origin_access_identity" "cf_oai" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "OAI to restrict access to AWS S3 content"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.selina_website.aws_route53_record.acm_certificate_validation_records["*.selinaklepic.com"] will be created
  + resource "aws_route53_record" "acm_certificate_validation_records" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.selina_website.aws_route53_record.acm_certificate_validation_records["selinaklepic.com"] will be created
  + resource "aws_route53_record" "acm_certificate_validation_records" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 300
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.selina_website.aws_route53_record.website_cloudfront_record will be created
  + resource "aws_route53_record" "website_cloudfront_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "selinaklepic.com"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.selina_website.aws_route53_record.www_website_record will be created
  + resource "aws_route53_record" "www_website_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.selinaklepic.com"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.selina_website.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "selinaklepic.com"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "prod"
          + "Prefix"      = "tme"
          + "Terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.selina_website.aws_s3_bucket_cors_configuration.this will be created
  + resource "aws_s3_bucket_cors_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "Authorization",
              + "Content-Length",
            ]
          + allowed_methods = [
              + "GET",
              + "POST",
            ]
          + allowed_origins = [
              + "https://selinaklepic.com",
            ]
          + expose_headers  = []
          + max_age_seconds = 3600
        }
    }

  # module.selina_website.aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.selina_website.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.selina_zone.aws_route53_record.this["0"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "selinaklepic.com"
      + records         = [
          + "5 smtpin.rzone.de",
        ]
      + ttl             = 150
      + type            = "MX"
      + zone_id         = (known after apply)
    }

  # module.selina_zone.aws_route53_zone.this will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "selinaklepic.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = {
          + "Environment" = "prod"
          + "Prefix"      = "tme"
          + "Terraform"   = "true"
        }
      + zone_id             = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @tobimichael96, Action: `pull_request`*